In [2]:
import pandas as pd
import csv
import numpy as np
import matplotlib.pyplot as plt

In [236]:
# Importing the datasets
bbc = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\bbc.csv")
eteam = bbc = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\eteam.csv", encoding='iso8859_2')
game = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\game.csv")
goal = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\goal.csv", encoding='iso8859_2')
movies = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\movies.csv")
world = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\world.csv", encoding='iso8859_2')
nobel = pd.read_csv(r"C:\Users\hansf\Documents\ADS_2020\DataWrangling\datasets\nobel.csv", encoding='iso8859_2')

In [237]:
bbc.head()

    id        teamname             coach
0  POL          Poland  Franciszek Smuda
1  RUS          Russia     Dick Advocaat
2  CZE  Czech Republic      Michal Bílek
3  GRE          Greece   Fernando Santos
4  NED     Netherlands  Bert van Marwijk

## question 1

If you know that in the world table, the continent of the countries Armenia,
Azerbaijan, Russia, Georgia and Turkey is not Europe. Write a query that
returns the total area of the European countries after adding the area of
these countries.

In [4]:
world.head()

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+11,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+11,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...

In [5]:
# list to countries to add in Europe
countries = ['Armenia', "Azerbaijan", "Russia", "Georgia", "Turkey"]

In [6]:
europe = sum(world['area'][world['continent']=='Europe']) # area of europe
others = sum(world['area'][world['name'].isin(countries)]) #area of other contries
europe + others

26809176

## SQL Query
select sum(population) from world where continent = 'Europe' or world.name in ('Armenia', 'Azerbaijan', 'Russia', 'Georgia', 'Turkey')

## Question 2.
Write a query that returns the names of the players in the German team who
scored at least one goal with the name of the stadium where they scored the
goals.

In [7]:
game.head()

     id      mdate                    stadium team1 team2
0  1001   8-Jun-12   National Stadium, Warsaw   POL   GRE
1  1002   8-Jun-12  Stadion Miejski (Wroclaw)   RUS   CZE
2  1003  12-Jun-12  Stadion Miejski (Wroclaw)   GRE   CZE
3  1004  12-Jun-12   National Stadium, Warsaw   POL   RUS
4  1005  16-Jun-12  Stadion Miejski (Wroclaw)   CZE   POL

In [8]:
goal.head()

   matchid teamid                player  gtime
0     1001    POL    Robert Lewandowski     17
1     1001    GRE  Dimitris Salpingidis     51
2     1002    RUS          Alan Dzagoev     15
3     1002    RUS        Roman Shirokov     24
4     1002    CZE          Václav Pilar     52

In [9]:

merged = pd.merge(game, goal, left_on='id', right_on='matchid')

In [10]:
# Each valeu, represents one goal.
merged[['player','stadium']][merged['teamid'] == 'GER']

            player                   stadium
15     Mario Gómez                Arena Lviv
21     Mario Gómez          Metalist Stadium
22     Mario Gómez          Metalist Stadium
27  Lukas Podolski                Arena Lviv
29     Lars Bender                Arena Lviv
61    Philipp Lahm          PGE Arena Gdansk
63    Sami Khedira          PGE Arena Gdansk
64  Miroslav Klose          PGE Arena Gdansk
65      Marco Reus          PGE Arena Gdansk
71      Mesut Özil  National Stadium, Warsaw

## SQL QUERY
select player, stadium from game inner join goal on game.id = goal.matchid where goal.teamid = 'GER'

## Question 3.
Write a query which would show the players and their teams for those who
have scored against France (FRA) in Donbass Arena.

In [11]:
merged.loc[:,['player', 'teamid', 'stadium']][(((merged['team1'] == 'FRA') | (merged['team2'] == 'FRA')) & (merged['teamid'] != 'FRA') & (merged['stadium'] == 'Donbass Arena'))]

            player teamid        stadium
45  Joleon Lescott    ENG  Donbass Arena
67     Xabi Alonso    ESP  Donbass Arena
68     Xabi Alonso    ESP  Donbass Arena

In [12]:
merged

,id,mdate,stadium,team1,team2,matchid,teamid,player,gtime
0,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001,POL,Robert Lewandowski,17
1,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001,GRE,Dimitris Salpingidis,51
2,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,RUS,Alan Dzagoev,15
3,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,RUS,Roman Shirokov,24
4,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,CZE,Václav Pilar,52
...,...,...,...,...,...,...,...,...,...
71,1030,28-Jun-12,"National Stadium, Warsaw",GER,ITA,1030,GER,Mesut Özil,90
72,1031,1-Jul-12,Olimpiyskiy National Sports Complex,ESP,ITA,1031,ESP,David Silva,14
73,1031,1-Jul-12,Olimpiyskiy National Sports Complex,ESP,ITA,1031,ESP,Jordi Alba,41
74,1031,1-Jul-12,Olimpiyskiy National Sports Complex,ESP,ITA,1031,ESP,Fernando Torres,84
75,1031,1-Jul-12,Olimpiyskiy National Sports Complex,ESP,ITA,1031,ESP,Juan Mata,88

# SQL Query

select player, teamid, stadium from game inner join goal on game.id = goal.matchid where (((game.team1 = 'FRA') or (game.team2 = 'FRA')) and (goal.teamid != 'FRA') and (game.stadium = 'Donbass Arena') )

## Question 4.
Write a query that displays the name and the the average population of the
continent in the world table.

In [13]:
world.head()

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+11,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+11,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...

In [14]:

world['population'].groupby(world['continent']).mean()

continent
Africa           1.917153e+07
Asia             9.240331e+07
Caribbean        3.286291e+06
Eurasia          7.450870e+07
Europe           1.386959e+07
North America    4.715956e+07
Oceania          2.698820e+06
South America    3.135531e+07
Name: population, dtype: float64

## SQL QUERY

select continent, AVG(population) from world GROUP BY world.continent

## Question 5.
Write a query to return the number of missing values in each column of the
world table [only in Python for now]. Use the world table.

In [15]:
# Info is a easy way, look at average of the values (195)
world.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        195 non-null    object
 1   continent   195 non-null    object
 2   area        195 non-null    int64
 3   population  195 non-null    int64
 4   gdp         189 non-null    float64
 5   capital     194 non-null    object
 6   tld         195 non-null    object
 7   flag        195 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 12.3+ KB

In [16]:
# to display the numbers of missing values instead 
world.isnull().sum()

name          0
continent     0
area          0
population    0
gdp           6
capital       1
tld           0
flag          0
dtype: int64

## SQL QUERY

No need to answer :)

## Question 6.
Write a query that lists the countries with no missing values in their gdp.
Use the world table.

In [17]:
# list of countries with not NULL values
world['name'][world['gdp'].notnull()]

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
190      Venezuela
191        Vietnam
192          Yemen
193         Zambia
194       Zimbabwe
Name: name, Length: 189, dtype: object

In [18]:
#just to check the names with NULL values
world['name'][world['gdp'].isnull()]

38     Congo, Democratic Republic of
39                Congo, Republic of
61                            Gambia
99                         Macedonia
169                           Taiwan
189                     Vatican City
Name: name, dtype: object

## SQL Query
select name from world where gdp is null

## Question 7.
Write a query that lists the countries with no missing values in any of their
attributes [only in Python for now]. Use the world table.

In [19]:
# Kind of same exercise as before...
columns = list(world.columns) # put all columns to make code simple

world_2 = world[world[columns].notnull()]
world_2

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+11,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+11,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...
...,...,...,...,...,...,...,...,...
190,Venezuela,South America,916445,28946101,3.824240e+11,Caracas,.ve,//upload.wikimedia.org/wikipedia/commons/0/06/...
191,Vietnam,Asia,331212,89708900,1.558200e+11,Hanoi,.vn,//upload.wikimedia.org/wikipedia/commons/2/21/...
192,Yemen,Asia,527968,25235000,3.283100e+10,Sanaa,.ye,//upload.wikimedia.org/wikipedia/commons/8/89/...
193,Zambia,Africa,752612,15023315,2.149000e+10,Lusaka,.zm,//upload.wikimedia.org/wikipedia/commons/0/06/...
194,Zimbabwe,Africa,390757,13061239,9.802000e+09,Harare,.zw,//upload.wikimedia.org/wikipedia/commons/6/6a/...

In [20]:
#show only a Series of country names
world_2['name']

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
190      Venezuela
191        Vietnam
192          Yemen
193         Zambia
194       Zimbabwe
Name: name, Length: 195, dtype: object

## SQL QUERY

## Question 8.
Write a query to calculate the average budget for movies produced in USA
since 2010 (incl. 2010). Use the movies table.

In [21]:
movies.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [22]:

print('Average Budget from Movies since 2010:', movies['budget'][movies['title_year']>=2010].mean())

Average Budget from Movies since 2010: 47402799.74136321

## SQL QUERY
select avg(budget) from movies where movies.title_year >= '2010'

## Question 9.
Write a query to count the number of unique directors by names. Use the
movies table.

In [23]:
print('Number of unique director: ', len(movies['director_name'].unique()))

Number of unique director:  1893

## SQL QUERY 
select count( distinct director_name) from movies

## Question 10.
Write a query that returns the years in which no Nobel price is given for
physics. Use the nobel table.

In [24]:
nobel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 969 entries, 0 to 968
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   yr       969 non-null    int64
 1   subject  969 non-null    object
 2   winner   969 non-null    object
dtypes: int64(1), object(2)
memory usage: 22.8+ KB

In [25]:
# check the names, physics in the df is writing Physics
nobel['subject'].unique()

array(['Chemistry', 'Literature', 'Medicine', 'Peace', 'Physics',
       'Economics'], dtype=object)

In [26]:
# list of years that nobels goes to Physics
nobel['yr'][nobel['subject'] != 'Physics']

0      1901
1      1901
2      1901
3      1901
4      1901
       ...
961    2016
962    2016
963    2016
964    2016
965    2016
Name: yr, Length: 747, dtype: int64

## SQL QUERY 
select distinct yr from nobel where subject != 'Physics'

## Question 11.
Write a query to count the number of Nobel price winners from Netherlands.
Use nobel table.

In [27]:
# it looks like the df dosent have country... :()
nobel.head()

     yr     subject                        winner
0  1901   Chemistry  Jacobus Henricus van 't Hoff
1  1901  Literature               Sully Prudhomme
2  1901    Medicine        Emil Adolf von Behring
3  1901       Peace             Jean Henry Dunant
4  1901       Peace              FrĂŠdĂŠric Passy

## SQL QUERY

## Question 12.
Write a query to find the number of Nobel price winners of each country.
Use nobel table.

## Question 13
Write a query to count the number of Nobel prize winners in Physics. Use
nobel table.

In [28]:
nobel['winner'][nobel['subject']=='Physics'].count()

222

## Question 14
Write a query to ﬁnd the number of Nobel prize winners in each subject. Use nobel table.

In [29]:
nobel['winner'].groupby(nobel['subject']).count()

subject
Chemistry     194
Economics      83
Literature    113
Medicine      227
Peace         130
Physics       222
Name: winner, dtype: int64

In [30]:
nobel

       yr     subject                        winner
0    1901   Chemistry  Jacobus Henricus van 't Hoff
1    1901  Literature               Sully Prudhomme
2    1901    Medicine        Emil Adolf von Behring
3    1901       Peace             Jean Henry Dunant
4    1901       Peace              FrĂŠdĂŠric Passy
..    ...         ...                           ...
964  2016    Medicine              Yoshinori Ohsumi
965  2016       Peace            Juan Manuel Santos
966  2016     Physics             David J. Thouless
967  2016     Physics          F. Duncan M. Haldane
968  2016     Physics         J. Michael Kosterlitz

[969 rows x 3 columns]

## SQL QUERY
select subject,count(*) from nobel group by subject

## Question 15 

Return the top 5 scores(most goals on the whole dataset), with country

In [40]:
goal.head()

   matchid teamid                player  gtime
0     1001    POL    Robert Lewandowski     17
1     1001    GRE  Dimitris Salpingidis     51
2     1002    RUS          Alan Dzagoev     15
3     1002    RUS        Roman Shirokov     24
4     1002    CZE          Václav Pilar     52

In [81]:
eteam.head()

    id        teamname             coach
0  POL          Poland  Franciszek Smuda
1  RUS          Russia     Dick Advocaat
2  CZE  Czech Republic      Michal Bílek
3  GRE          Greece   Fernando Santos
4  NED     Netherlands  Bert van Marwijk

In [41]:
game.head()

     id      mdate                    stadium team1 team2
0  1001   8-Jun-12   National Stadium, Warsaw   POL   GRE
1  1002   8-Jun-12  Stadion Miejski (Wroclaw)   RUS   CZE
2  1003  12-Jun-12  Stadion Miejski (Wroclaw)   GRE   CZE
3  1004  12-Jun-12   National Stadium, Warsaw   POL   RUS
4  1005  16-Jun-12  Stadion Miejski (Wroclaw)   CZE   POL

In [70]:
merged = pd.merge(goal, game, left_on='matchid', right_on='id')
merged.head()

,matchid,teamid,player,gtime,id,mdate,stadium,team1,team2
0,1001,POL,Robert Lewandowski,17,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE
1,1001,GRE,Dimitris Salpingidis,51,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE
2,1002,RUS,Alan Dzagoev,15,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE
3,1002,RUS,Roman Shirokov,24,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE
4,1002,CZE,Václav Pilar,52,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE

In [88]:
#number of goals
filter = ['teamid']
merged_2 = merged[filter].groupby(merged['player']).count().sort_values(by=["teamid"], ascending=False)
merged_2.rename(columns={'teamid':'goals'},inplace=True)
merged_2.head()

                   goals
player
Alan Dzagoev           3
Cristiano Ronaldo      3
Mario Gómez            3
Mario Balotelli        3
Fernando Torres        3

In [147]:
# join to pickup (country) order and then filter only the top 5
merged_3 = pd.merge(merged_2, merged, left_on='player', right_on='player')
merged_3[['player','goals', 'teamid']].sort_values(by=['goals','player'], ascending=False).drop_duplicates()[0:5]

               player  goals teamid
15    Mario Mandukic      3    CRO
6         Mario Gómez      3    GER
9     Mario Balotelli      3    ITA
12    Fernando Torres      3    ESP
3   Cristiano Ronaldo      3    POR

## SQL Query
select goal.player, count(teamid) from game inner join goal on game.id = goal.matchid group by goal.player order by count(teamid) desc, player desc

## Question 16
Return the number of game with 0 x 0 (show team 1 and team 2)

In [185]:
full_merged = pd.merge(game, goal, how='outer', left_on='id', right_on='matchid') # puts the games with 0 x 0 ( if use inner join this values dosent shows)
full_merged.head()

,id,mdate,stadium,team1,team2,matchid,teamid,player,gtime
0,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001.0,POL,Robert Lewandowski,17.0
1,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001.0,GRE,Dimitris Salpingidis,51.0
2,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002.0,RUS,Alan Dzagoev,15.0
3,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002.0,RUS,Roman Shirokov,24.0
4,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002.0,CZE,Václav Pilar,52.0

In [201]:
results = full_merged[full_merged['matchid'].isnull()] # matches with 0 x 0 
results

,id,mdate,stadium,team1,team2,matchid,teamid,player,gtime
69,1028,24-Jun-12,Olimpiyskiy National Sports Complex,ENG,ITA,NaN,NaN,NaN,NaN
70,1029,27-Jun-12,Donbass Arena,POR,ESP,NaN,NaN,NaN,NaN

In [202]:
#showing only the results
full_merged[['team1', 'team2']][full_merged['matchid'].isnull()]

   team1 team2
69   ENG   ITA
70   POR   ESP

In [207]:
full_merged['matchid'].isnull().sum()

2

## SQL Query
select team1, team2 from game full outer join goal on game.id = goal.matchid where matchid is NULL

## Query Matchid, Avg time of gols and number of goals by match
select matchid , round(avg(gtime),2) as Avg_goal_time, count(matchid) as num_goals from game full outer join goal on game.id = goal.matchid group by matchid having matchid is not null

In [218]:
full_merged[['gtime']].groupby(full_merged['matchid']).agg(['count', 'mean'])

        gtime
        count       mean
matchid
1001.0      2  34.000000
1002.0      5  50.400000
1003.0      3  20.666667
1004.0      2  47.000000
1005.0      1  72.000000
1006.0      1  45.000000
1007.0      1  24.000000
1008.0      1  72.000000
1009.0      5  53.600000
1010.0      3  45.000000
1011.0      3  37.666667
1012.0      3  41.000000
1013.0      2  62.500000
1014.0      4  28.500000
1015.0      2  55.500000
1016.0      4  51.500000
1017.0      1  88.000000
1018.0      2  62.500000
1019.0      2  34.500000
1020.0      3  56.333333
1021.0      2  54.500000
1022.0      5  54.600000
1023.0      1  48.000000
1024.0      2  72.000000
1025.0      1  79.000000
1026.0      6  64.333333
1027.0      2  54.500000
1030.0      3  48.666667
1031.0      4  56.750000

In [219]:
full_merged[full_merged['teamid'] == 'NED']

,id,mdate,stadium,team1,team2,matchid,teamid,player,gtime
23,1010,13-Jun-12,Metalist Stadium,NED,GER,1010.0,NED,Robin van Persie,73.0
24,1011,17-Jun-12,Metalist Stadium,POR,NED,1011.0,NED,Rafael van der Vaart,11.0

## Selecting with STR

In [149]:
movies[movies["genres"].str.contains("Comedy")]

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
7,Color,Nathan Greno,324.0,100.0,15.0,284.0,Donna Murphy,799.0,200807262.0,Adventure|Animation|Comedy|Family|Fantasy|Musi...,...,387.0,English,USA,PG,260000000.0,2010.0,553.0,7.8,1.85,29000
19,Color,Barry Sonnenfeld,451.0,106.0,188.0,718.0,Michael Stuhlbarg,10000.0,179020854.0,Action|Adventure|Comedy|Family|Fantasy|Sci-Fi,...,341.0,English,USA,PG-13,225000000.0,2012.0,816.0,6.8,1.85,40000
35,Color,Dan Scanlon,376.0,104.0,37.0,760.0,Tyler Labine,12000.0,268488329.0,Adventure|Animation|Comedy|Family|Fantasy,...,265.0,English,USA,G,200000000.0,2013.0,779.0,7.3,1.85,44000
41,Color,John Lasseter,304.0,106.0,487.0,776.0,Thomas Kretschmann,1000.0,191450875.0,Adventure|Animation|Comedy|Family|Sport,...,283.0,English,USA,G,200000000.0,2011.0,919.0,6.3,2.35,10000
43,Color,Lee Unkrich,453.0,103.0,125.0,721.0,John Ratzenberger,15000.0,414984497.0,Adventure|Animation|Comedy|Family|Fantasy,...,733.0,English,USA,G,200000000.0,2010.0,1000.0,8.3,1.85,30000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3993,Color,Julie Davis,5.0,86.0,12.0,117.0,Meredith Scott Lynn,238.0,33598.0,Comedy|Romance,...,15.0,English,USA,R,NaN,1997.0,166.0,5.4,NaN,97
3994,Color,Myles Berkowitz,32.0,87.0,0.0,153.0,Tom Ardavany,1000.0,536767.0,Biography|Comedy|Romance,...,83.0,English,USA,R,60000.0,1998.0,184.0,5.3,1.85,30
3996,Color,Morgan Spurlock,193.0,100.0,293.0,0.0,Amanda Kearsan,0.0,11529368.0,Comedy|Documentary|Drama,...,404.0,English,USA,PG,65000.0,2004.0,0.0,7.3,1.78,0
3997,Color,Brandon Trost,66.0,82.0,32.0,128.0,Sean Whalen,968.0,40557.0,Comedy,...,22.0,English,USA,R,60000.0,2011.0,407.0,5.6,2.35,0
3998,Color,Joe Swanberg,65.0,82.0,217.0,442.0,Lena Dunham,10000.0,30084.0,Comedy|Drama,...,23.0,English,USA,R,70000.0,2014.0,969.0,5.6,1.85,812

In [222]:
full_merged['player'].value_counts()

Mario Balotelli                      3
Alan Dzagoev                         3
Fernando Torres                      3
Mario Gómez                          3
Cristiano Ronaldo                    3
Mario Mandukic                      3
Zlatan Ibrahimovic                   2
Dimitris Salpingidis                 2
Michael Krohn-Dehli                  2
Xabi Alonso                          2
Cesc Fŕbregas                        2
Václav Pilar                         2
David Silva                          2
Nicklas Bendtner                     2
Andriy Shevchenko                    2
Petr Jirácek                         2
Roman Pavlyuchenko                   1
Glen Johnson (English footballer)    1
Georgios Samaras                     1
Jakub Blaszczykowski                 1
Jesús Navas                          1
Theofanis Gekas                      1
Wayne Rooney                         1
Lukas Podolski                       1
Andrea Pirlo                         1
Silvestre Varela                     1
Samir Nasri                          1
Mesut Özil                           1
Nikica Jelavic                       1
Giorgos Karagounis                   1
Joleon Lescott                       1
Yohan Cabaye                         1
Pepe (footballer born 1983)          1
Sami Khedira                         1
Jordi Alba                           1
Theo Walcott                         1
Antonio Cassano                      1
Marco Reus                           1
Olof Mellberg                        1
Hélder Postiga                       1
Miroslav Klose                       1
Lars Bender                          1
Philipp Lahm                         1
Rafael van der Vaart                 1
Robert Lewandowski                   1
Juan Mata                            1
Sean St Ledger                       1
Antonio Di Natale                    1
Andy Carroll                         1
Jérémy Ménez                         1
Robin van Persie                     1
Sebastian Larsson                    1
Roman Shirokov                       1
Danny Welbeck                        1
Name: player, dtype: int64

In [225]:
bbc.head()

    id        teamname             coach
0  POL          Poland  Franciszek Smuda
1  RUS          Russia     Dick Advocaat
2  CZE  Czech Republic      Michal Bílek
3  GRE          Greece   Fernando Santos
4  NED     Netherlands  Bert van Marwijk

## Querying SQL in pandas

In [154]:

# Import pandas and pandasql 🐼
import pandas as pd
from pandasql import sqldf

In [ ]:
# Define a lambda function to translate your SQL queries to Python
pysqldf = lambda q: sqldf(q, globals())
# Play with your data using SQL. Change the value of the variable 'query' to yield different results
query = 'select goal.player, count(teamid) from game inner join goal on game.id = goal.matchid group by goal.player order by count(teamid) desc, player desc;'
pysqldf(input())

In [162]:
pysqldf(input())

 select subject,count(*) from nobel group by subject

      subject  count(*)
0   Chemistry       194
1   Economics        83
2  Literature       113
3    Medicine       227
4       Peace       130
5     Physics       222